jramshur/SRD_Firmware/SRD_Main_oldold.cydsn/Generated_Source/PSoC3/project.h
/*******************************************************************************
 * File Name: project.h
 * cydsfit No Version Information Found
 *
 *  Description:
 *  This file is automatically generated by PSoC Creator and should not 
 *  be edited by hand.
 *
 *
 ********************************************************************************
 * Copyright 2008-2013, Cypress Semiconductor Corporation.  All rights reserved.
 * You may use this file only in accordance with the license, terms, conditions, 
 * disclaimers, and limitations in the end user license agreement accompanying 
 * the software package with which this file was provided.
 ********************************************************************************/

#include <cyfitter_cfg.h>
#include <cydevice.h>
#include <cydevice_trm.h>
#include <cyfitter.h>
#include <cydisabledsheets.h>
#include <DEBUG_UART.h>
#include <RTC.h>
#include <DMA_1_dma.h>
#include <LED_R.h>
#include <LED_R_aliases.h>
#include <TimerISR_3.h>
#include <DMA_ISR.h>
#include <timer_clock_3.h>
#include <Timer_3.h>
#include <ISR_COMM_UART_RX.h>
#include <TickTimer_ISR.h>
#include <COMM_UART.h>
#include <DMA_2_dma.h>
#include <timer_clock_1.h>
#include <Tick_Timer.h>
#include <TimerISR_1.h>
#include <timer_clock.h>
#include <ISR_Switch_1.h>
#include <Timer_1.h>
#include <DMA_ISR_1.h>
#include <Button.h>
#include <Button_aliases.h>
#include <DMA_ISR_2.h>
#include <m_ss_pin.h>
#include <m_ss_pin_aliases.h>
#include <PWM_1.h>
#include <SPIM.h>
#include <SPIM_PVT.h>
#include <m_sclk_pin.h>
#include <m_sclk_pin_aliases.h>
#include <m_miso_pin.h>
#include <m_miso_pin_aliases.h>
#include <m_mosi_pin.h>
#include <m_mosi_pin_aliases.h>
#include <clock_3.h>
#include <DMA_3_dma.h>
#include <DMA_ISR_3.h>
#include <LED_G.h>
#include <LED_G_aliases.h>
#include <clock_1.h>
#include <pin_iSink.h>
#include <pin_iSink_aliases.h>
#include <Pin_StimSel.h>
#include <Pin_StimSel_aliases.h>
#include <Control_Reg_StimSel.h>
#include <IDAC8_Source.h>
#include <IDAC8_Sink.h>
#include <pin_iSource.h>
#include <pin_iSource_aliases.h>
#include <LED_B.h>
#include <LED_B_aliases.h>
#include <DEBUG_UART_IntClock.h>
#include <COMM_UART_IntClock.h>
#include <CyDmac.h>
#include <CyFlash.h>
#include <CyLib.h>
#include <cypins.h>
#include <cyPm.h>
#include <CySpc.h>
#include <cytypes.h>
#include <PSoC3_8051.h>

/*[]*/

